meeTeam05/smart-air/firmware/sdkconfig.defaults
# Normal firmware baseline.
# Keep target + core hardware features in tracked defaults so fresh builds do not
# fall back to ESP32 or disable NimBLE provisioning support.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BOOTLOADER_OFFSET_IN_FLASH=0x0
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="main/partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="main/partitions.csv"
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_SA_SNTP_SERVER="pool.ntp.org"
CONFIG_SA_SNTP_SYNC_TIMEOUT_MS=10000
CONFIG_SA_TIMEZONE="ICT-7"
CONFIG_WS_BUFFER_SIZE=4096
CONFIG_WS_DYNAMIC_BUFFER=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
